tests/load/api-load-test.yml
# Artillery Load Test Configuration - API Endpoints
# Target: 1,000 concurrent users, 10,000 requests/min
#
# Run with: artillery run api-load-test.yml
# Report: artillery run --output report.json api-load-test.yml && artillery report report.json

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase - gradual ramp up
    - duration: 60
      arrivalRate: 10
      name: "Warm-up: 10 users/sec"

    # Ramp-up phase - increase load
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up: 10 → 50 users/sec"

    # Sustained load - target load
    - duration: 300
      arrivalRate: 50
      name: "Sustained: 50 users/sec (3,000/min)"

    # Peak load - stress test
    - duration: 120
      arrivalRate: 100
      name: "Peak: 100 users/sec (6,000/min)"

    # Spike test - max capacity
    - duration: 60
      arrivalRate: 200
      name: "Spike: 200 users/sec (12,000/min)"

    # Cool-down
    - duration: 60
      arrivalRate: 10
      name: "Cool-down: 10 users/sec"

  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 500         # 95th percentile < 500ms
    p99: 1000        # 99th percentile < 1000ms

  # Test variables
  variables:
    apiVersion: "v1"

  # Payload definitions
  payload:
    path: "./test-data/users.csv"
    fields:
      - "email"
      - "password"
    order: "sequence"
    skipHeader: true

  # Plugins for enhanced metrics
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # HTTP defaults
  http:
    timeout: 10

scenarios:
  # Scenario 1: Read-heavy user flow (70% of traffic)
  - name: "Read Operations - Meetings & Transcripts"
    weight: 70
    flow:
      # Authentication
      - post:
          url: "/api/auth/login"
          json:
            email: "test-user-{{ $randomNumber() }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.accessToken"
              as: "authToken"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: accessToken

      # Get user profile
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - contentType: json

      # List meetings with pagination
      - get:
          url: "/api/meetings?page=1&limit=20&sortBy=createdAt&sortOrder=desc"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
            - hasProperty: total

      # Search meetings
      - get:
          url: "/api/meetings?search=team meeting&status=completed"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Get specific meeting
      - get:
          url: "/api/meetings/{{ $randomString() }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 404]

      # Get transcriptions
      - get:
          url: "/api/transcriptions?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Dashboard analytics (cached)
      - get:
          url: "/api/analytics/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - contentType: json

      # Think time between requests
      - think: 2

  # Scenario 2: Write operations (20% of traffic)
  - name: "Write Operations - Create & Update"
    weight: 20
    flow:
      # Authentication
      - post:
          url: "/api/auth/login"
          json:
            email: "test-user-{{ $randomNumber() }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.accessToken"
              as: "authToken"

      # Create meeting
      - post:
          url: "/api/meetings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Load Test Meeting {{ $randomNumber() }}"
            description: "Automated load testing"
            scheduledAt: "{{ $now() }}"
            platform: "zoom"
            participants:
              - email: "participant1@example.com"
                name: "Test Participant"
          capture:
            - json: "$.id"
              as: "meetingId"
          expect:
            - statusCode: 201
            - contentType: json

      # Update meeting
      - put:
          url: "/api/meetings/{{ meetingId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Updated Load Test Meeting"
            status: "in_progress"
          expect:
            - statusCode: 200

      # Start meeting
      - post:
          url: "/api/meetings/{{ meetingId }}/start"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Think time
      - think: 1

      # Complete meeting
      - post:
          url: "/api/meetings/{{ meetingId }}/complete"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Scenario 3: Analytics queries (10% of traffic)
  - name: "Analytics & Reporting"
    weight: 10
    flow:
      # Authentication
      - post:
          url: "/api/auth/login"
          json:
            email: "test-user-{{ $randomNumber() }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.accessToken"
              as: "authToken"

      # Dashboard analytics
      - get:
          url: "/api/analytics/dashboard?period=thirty_days"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Meeting analytics
      - get:
          url: "/api/analytics/meetings?startDate={{ $now() }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Transcript analytics
      - get:
          url: "/api/analytics/transcripts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # User analytics
      - get:
          url: "/api/analytics/users"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Engagement analytics
      - get:
          url: "/api/analytics/engagement"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

# After test hooks
after:
  flow:
    - log: "Load test completed - check metrics for performance analysis"